<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"38a1e484ae193fd3f929aabd2beee992d9734e4ab15a8e2776c8d58afcee9b39","plan_job_ref":"Job .github/workflows/_test-tf.yaml #3 at https://github.com/DND-IT/github-workflows/actions/runs/13987386109","plan_out_hash":"85395282b311eb83f13bf7090f9e9c4df8b2b948ab1c43c7cad72e446643fbd1","plan_hash":"66354ef0f35b3c6dbea417fc5c6be09c8c4a368460d6fc8b34f3aa703014336d","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #3](https://github.com/DND-IT/github-workflows/actions/runs/13987386109)